src/assets/artifacts/Spring-PetClinic/telemetry/behavior-models/dfg/dfg.dot
digraph {
	graph [bgcolor=white rankdir=LR]
	node [shape=box]
	-1183944809429016101 [label="ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	-7516594441774528340 [label="ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	-7978386479251712764 [label="ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	194265572021566824 [label="ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	1232457540412805408 [label="ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	-4792675656448852655 [label="ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3232544143138661610 [label="CREATE INDEX 29058b98-4ccd-4e90-9f58-e90fdf3b4e76 (6)" fillcolor="#E7E7FF" fontsize=12 style=filled]
	-6008162635373812652 [label="CREATE INDEX 9f78a28c-0668-4b3b-b691-5b8d19cd8c17 (6)" fillcolor="#E7E7FF" fontsize=12 style=filled]
	-7864625596583603474 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-2231845523189148436 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	6760333335114638891 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	7392443708212353807 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-1626324112451635672 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7040235917359351557 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8925240885066595420 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-6391181445701654379 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	2529360590580469083 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	4062147385704992595 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-1187268405029073084 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-8062160338008435956 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-8688994274347892708 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-9216642184502529798 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	4710305265067996110 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	4895662336838796762 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8868997438856158539 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7606519017536437126 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-27936799700436060 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	7563132947373341738 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3192963732667889907 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-139539415853612002 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7144708872952553836 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-6368497674408633974 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7506035691826376527 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3529118255250252805 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	3969731126099003918 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7474636469833490139 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	7773336325209533250 [label="GET (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7634212243150458484 [label="GET /owners (3)" fillcolor="#F5F5FF" fontsize=12 style=filled]
	7245863080994552504 [label="GET /owners/find (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	3291950269559915352 [label="GET /owners/new (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-8229577703596980426 [label="GET /owners/{ownerId} (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	-7465657065378787400 [label="GET /owners/{ownerId}/edit (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5269701950432783699 [label="GET /owners/{ownerId}/pets/new (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-6446216386472168986 [label="GET /owners/{ownerId}/pets/{petId}/edit (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5979961705843239464 [label="GET /owners/{ownerId}/pets/{petId}/visits/new (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5951601462970580792 [label="GET /vets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7727482673800771863 [label="GET /vets.html (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-8858789570252260686 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners (10)" fillcolor="#D4D4FF" fontsize=12 style=filled]
	-4144684539351846177 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets (13)" fillcolor="#C5C5FF" fontsize=12 style=filled]
	-1503508163139766309 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties (3)" fillcolor="#F5F5FF" fontsize=12 style=filled]
	7044887414242742577 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types (6)" fillcolor="#E7E7FF" fontsize=12 style=filled]
	-5760251649658890916 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties (5)" fillcolor="#EBEBFF" fontsize=12 style=filled]
	1743937743953222066 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets (6)" fillcolor="#E7E7FF" fontsize=12 style=filled]
	2104865303453619159 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (4)" fillcolor="#F0F0FF" fontsize=12 style=filled]
	-7305422824435554587 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners (11)" fillcolor="#CFCFFF" fontsize=12 style=filled]
	-8256903376324463459 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (14)" fillcolor="#C1C1FF" fontsize=12 style=filled]
	7319103074952475507 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties (3)" fillcolor="#F5F5FF" fontsize=12 style=filled]
	-8290192238267553861 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types (6)" fillcolor="#E7E7FF" fontsize=12 style=filled]
	5733096154227186625 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties (5)" fillcolor="#EBEBFF" fontsize=12 style=filled]
	1883060305230511077 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets (6)" fillcolor="#E7E7FF" fontsize=12 style=filled]
	5375873172119901917 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (5)" fillcolor="#EBEBFF" fontsize=12 style=filled]
	788834266815753489 [label="MockHttpServletResponse.sendRedirect (7)" fillcolor="#E2E2FF" fontsize=12 style=filled]
	7040690479689377268 [label="OwnerRepository.findById (12)" fillcolor="#CACAFF" fontsize=12 style=filled]
	-5579716253936651218 [label="OwnerRepository.findByLastName (4)" fillcolor="#F0F0FF" fontsize=12 style=filled]
	-5686982716783255678 [label="OwnerRepository.findPetTypes (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	1065472391189712335 [label="OwnerRepository.save (5)" fillcolor="#EBEBFF" fontsize=12 style=filled]
	-9023236468098462432 [label="POST /owners/new (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	-2210481173645739524 [label="POST /owners/{ownerId}/edit (3)" fillcolor="#F5F5FF" fontsize=12 style=filled]
	-3303103327247872000 [label="POST /owners/{ownerId}/pets/new (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	8158417003762305490 [label="POST /owners/{ownerId}/pets/{petId}/edit (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	3972374482261021816 [label="POST /owners/{ownerId}/pets/{petId}/visits/new (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	4160518648974263094 [label="SELECT (16)" fillcolor="#B7B7FF" fontsize=12 style=filled]
	6116439064274940224 [label="SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76 (8)" fillcolor="#DDDDFF" fontsize=12 style=filled]
	-2690019605849135219 [label="SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-788438699244083005 [label="SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-2920806751162053123 [label="SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	4100082517739030655 [label="SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17 (22)" fillcolor="#9B9BFF" fontsize=12 style=filled]
	5623235527225059113 [label="SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types (8)" fillcolor="#DDDDFF" fontsize=12 style=filled]
	-8442906383155784854 [label="SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5951143071141074222 [label="SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (10)" fillcolor="#D4D4FF" fontsize=12 style=filled]
	-7453857649329036938 [label="SELECT org.springframework.samples.petclinic.owner.PetType (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	4775552440608800478 [label="SELECT org.springframework.samples.petclinic.vet.Vet (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	3754714412428294541 [label="Session.merge org.springframework.samples.petclinic.owner.Owner (4)" fillcolor="#F0F0FF" fontsize=12 style=filled]
	-6519808900906610935 [label="Session.persist org.springframework.samples.petclinic.owner.Owner (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8177051740424950144 [label="Transaction.commit (3)" fillcolor="#F5F5FF" fontsize=12 style=filled]
	-684683110847593347 [label="UPDATE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	3593585793611197277 [label="UPDATE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	-2751735230932605449 [label="VetRepository.findAll (2)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	7773336325209533250 -> -8229577703596980426 [label=1 fontsize=12 penwidth=1.0]
	-7634212243150458484 -> 788834266815753489 [label=1 fontsize=12 penwidth=1.0]
	-8229577703596980426 -> 7040690479689377268 [label=1 fontsize=12 penwidth=1.0]
	7040690479689377268 -> 4160518648974263094 [label=12 fontsize=12 penwidth=2.5999985454558683]
	-5579716253936651218 -> 4160518648974263094 [label=4 fontsize=12 penwidth=1.4363632396697823]
	-5686982716783255678 -> -7453857649329036938 [label=2 fontsize=12 penwidth=1.1454544132232607]
	1065472391189712335 -> 3754714412428294541 [label=4 fontsize=12 penwidth=1.4363632396697823]
	1065472391189712335 -> -6519808900906610935 [label=1 fontsize=12 penwidth=1.0]
	-9023236468098462432 -> 788834266815753489 [label=1 fontsize=12 penwidth=1.0]
	-2210481173645739524 -> 788834266815753489 [label=2 fontsize=12 penwidth=1.1454544132232607]
	-3303103327247872000 -> 788834266815753489 [label=1 fontsize=12 penwidth=1.0]
	8158417003762305490 -> 788834266815753489 [label=1 fontsize=12 penwidth=1.0]
	3972374482261021816 -> 788834266815753489 [label=1 fontsize=12 penwidth=1.0]
	4160518648974263094 -> 6116439064274940224 [label=2 fontsize=12 penwidth=1.1454544132232607]
	4160518648974263094 -> 4100082517739030655 [label=11 fontsize=12 penwidth=2.4545441322326074]
	4160518648974263094 -> -684683110847593347 [label=1 fontsize=12 penwidth=1.0]
	4160518648974263094 -> 3593585793611197277 [label=2 fontsize=12 penwidth=1.1454544132232607]
	6116439064274940224 -> 6116439064274940224 [label=5 fontsize=12 penwidth=1.5818176528930428]
	6116439064274940224 -> -2690019605849135219 [label=1 fontsize=12 penwidth=1.0]
	6116439064274940224 -> 8177051740424950144 [label=2 fontsize=12 penwidth=1.1454544132232607]
	-2690019605849135219 -> -2920806751162053123 [label=1 fontsize=12 penwidth=1.0]
	-788438699244083005 -> 6116439064274940224 [label=1 fontsize=12 penwidth=1.0]
	-2920806751162053123 -> 8177051740424950144 [label=1 fontsize=12 penwidth=1.0]
	4100082517739030655 -> 4100082517739030655 [label=7 fontsize=12 penwidth=1.8727264793395644]
	4100082517739030655 -> 5623235527225059113 [label=6 fontsize=12 penwidth=1.7272720661163037]
	5623235527225059113 -> 5951143071141074222 [label=6 fontsize=12 penwidth=1.7272720661163037]
	-8442906383155784854 -> 4100082517739030655 [label=1 fontsize=12 penwidth=1.0]
	5951143071141074222 -> 5951143071141074222 [label=4 fontsize=12 penwidth=1.4363632396697823]
	-7453857649329036938 -> 5623235527225059113 [label=2 fontsize=12 penwidth=1.1454544132232607]
	4775552440608800478 -> -788438699244083005 [label=1 fontsize=12 penwidth=1.0]
	4775552440608800478 -> -8442906383155784854 [label=1 fontsize=12 penwidth=1.0]
	3754714412428294541 -> -8256903376324463459 [label=1 fontsize=12 penwidth=1.0]
	3754714412428294541 -> 5375873172119901917 [label=1 fontsize=12 penwidth=1.0]
	-6519808900906610935 -> -7305422824435554587 [label=1 fontsize=12 penwidth=1.0]
	8177051740424950144 -> 7040690479689377268 [label=1 fontsize=12 penwidth=1.0]
	-684683110847593347 -> 4100082517739030655 [label=1 fontsize=12 penwidth=1.0]
	3593585793611197277 -> 4100082517739030655 [label=2 fontsize=12 penwidth=1.1454544132232607]
	-2751735230932605449 -> 4775552440608800478 [label=2 fontsize=12 penwidth=1.1454544132232607]
	overlap=false
	fontsize=11
}
