src/assets/artifacts/Spring-PetClinic/telemetry/behavior-models/dfg/dfg.mmd
flowchart LR
  _1183944809429016101["ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets (2)"]
  _7516594441774528340["ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties (2)"]
  _7978386479251712764["ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (1)"]
  n_194265572021566824["ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (2)"]
  n_1232457540412805408["ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties (2)"]
  _4792675656448852655["ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (1)"]
  _3232544143138661610["CREATE INDEX 29058b98-4ccd-4e90-9f58-e90fdf3b4e76 (6)"]
  _6008162635373812652["CREATE INDEX 9f78a28c-0668-4b3b-b691-5b8d19cd8c17 (6)"]
  _7864625596583603474["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners (1)"]
  _2231845523189148436["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets (1)"]
  n_6760333335114638891["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties (1)"]
  n_7392443708212353807["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types (1)"]
  _1626324112451635672["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties (1)"]
  _7040235917359351557["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets (1)"]
  n_8925240885066595420["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (1)"]
  _6391181445701654379["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners (1)"]
  n_2529360590580469083["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (1)"]
  n_4062147385704992595["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties (1)"]
  _1187268405029073084["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types (1)"]
  _8062160338008435956["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties (1)"]
  _8688994274347892708["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets (1)"]
  _9216642184502529798["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (1)"]
  n_4710305265067996110["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners (1)"]
  n_4895662336838796762["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets (1)"]
  n_8868997438856158539["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties (1)"]
  _7606519017536437126["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types (1)"]
  _27936799700436060["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties (1)"]
  n_7563132947373341738["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets (1)"]
  _3192963732667889907["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (1)"]
  _139539415853612002["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners (1)"]
  _7144708872952553836["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (1)"]
  _6368497674408633974["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties (1)"]
  _7506035691826376527["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types (1)"]
  _3529118255250252805["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties (1)"]
  n_3969731126099003918["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets (1)"]
  _7474636469833490139["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (1)"]
  n_7773336325209533250["GET (1)"]
  _7634212243150458484["GET /owners (3)"]
  n_7245863080994552504["GET /owners/find (1)"]
  n_3291950269559915352["GET /owners/new (1)"]
  _8229577703596980426["GET /owners/{ownerId} (2)"]
  _7465657065378787400["GET /owners/{ownerId}/edit (1)"]
  n_5269701950432783699["GET /owners/{ownerId}/pets/new (1)"]
  _6446216386472168986["GET /owners/{ownerId}/pets/{petId}/edit (1)"]
  n_5979961705843239464["GET /owners/{ownerId}/pets/{petId}/visits/new (1)"]
  n_5951601462970580792["GET /vets (1)"]
  _7727482673800771863["GET /vets.html (1)"]
  _8858789570252260686["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners (10)"]
  _4144684539351846177["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets (13)"]
  _1503508163139766309["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties (3)"]
  n_7044887414242742577["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types (6)"]
  _5760251649658890916["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties (5)"]
  n_1743937743953222066["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets (6)"]
  n_2104865303453619159["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (4)"]
  _7305422824435554587["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners (11)"]
  _8256903376324463459["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (14)"]
  n_7319103074952475507["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties (3)"]
  _8290192238267553861["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types (6)"]
  n_5733096154227186625["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties (5)"]
  n_1883060305230511077["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets (6)"]
  n_5375873172119901917["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (5)"]
  n_788834266815753489["MockHttpServletResponse.sendRedirect (7)"]
  n_7040690479689377268["OwnerRepository.findById (12)"]
  _5579716253936651218["OwnerRepository.findByLastName (4)"]
  _5686982716783255678["OwnerRepository.findPetTypes (2)"]
  n_1065472391189712335["OwnerRepository.save (5)"]
  _9023236468098462432["POST /owners/new (2)"]
  _2210481173645739524["POST /owners/{ownerId}/edit (3)"]
  _3303103327247872000["POST /owners/{ownerId}/pets/new (2)"]
  n_8158417003762305490["POST /owners/{ownerId}/pets/{petId}/edit (2)"]
  n_3972374482261021816["POST /owners/{ownerId}/pets/{petId}/visits/new (2)"]
  n_4160518648974263094["SELECT (16)"]
  n_6116439064274940224["SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76 (8)"]
  _2690019605849135219["SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types (1)"]
  _788438699244083005["SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets (1)"]
  _2920806751162053123["SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits (1)"]
  n_4100082517739030655["SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17 (22)"]
  n_5623235527225059113["SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types (8)"]
  _8442906383155784854["SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets (1)"]
  n_5951143071141074222["SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits (10)"]
  _7453857649329036938["SELECT org.springframework.samples.petclinic.owner.PetType (2)"]
  n_4775552440608800478["SELECT org.springframework.samples.petclinic.vet.Vet (2)"]
  n_3754714412428294541["Session.merge org.springframework.samples.petclinic.owner.Owner (4)"]
  _6519808900906610935["Session.persist org.springframework.samples.petclinic.owner.Owner (1)"]
  n_8177051740424950144["Transaction.commit (3)"]
  _684683110847593347["UPDATE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners (1)"]
  n_3593585793611197277["UPDATE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets (2)"]
  _2751735230932605449["VetRepository.findAll (2)"]
  n_7773336325209533250 -->|1| _8229577703596980426
  _7634212243150458484 -->|1| n_788834266815753489
  _8229577703596980426 -->|1| n_7040690479689377268
  n_7040690479689377268 -->|12| n_4160518648974263094
  _5579716253936651218 -->|4| n_4160518648974263094
  _5686982716783255678 -->|2| _7453857649329036938
  n_1065472391189712335 -->|4| n_3754714412428294541
  n_1065472391189712335 -->|1| _6519808900906610935
  _9023236468098462432 -->|1| n_788834266815753489
  _2210481173645739524 -->|2| n_788834266815753489
  _3303103327247872000 -->|1| n_788834266815753489
  n_8158417003762305490 -->|1| n_788834266815753489
  n_3972374482261021816 -->|1| n_788834266815753489
  n_4160518648974263094 -->|2| n_6116439064274940224
  n_4160518648974263094 -->|11| n_4100082517739030655
  n_4160518648974263094 -->|1| _684683110847593347
  n_4160518648974263094 -->|2| n_3593585793611197277
  n_6116439064274940224 -->|5| n_6116439064274940224
  n_6116439064274940224 -->|1| _2690019605849135219
  n_6116439064274940224 -->|2| n_8177051740424950144
  _2690019605849135219 -->|1| _2920806751162053123
  _788438699244083005 -->|1| n_6116439064274940224
  _2920806751162053123 -->|1| n_8177051740424950144
  n_4100082517739030655 -->|7| n_4100082517739030655
  n_4100082517739030655 -->|6| n_5623235527225059113
  n_5623235527225059113 -->|6| n_5951143071141074222
  _8442906383155784854 -->|1| n_4100082517739030655
  n_5951143071141074222 -->|4| n_5951143071141074222
  _7453857649329036938 -->|2| n_5623235527225059113
  n_4775552440608800478 -->|1| _788438699244083005
  n_4775552440608800478 -->|1| _8442906383155784854
  n_3754714412428294541 -->|1| _8256903376324463459
  n_3754714412428294541 -->|1| n_5375873172119901917
  _6519808900906610935 -->|1| _7305422824435554587
  n_8177051740424950144 -->|1| n_7040690479689377268
  _684683110847593347 -->|1| n_4100082517739030655
  n_3593585793611197277 -->|2| n_4100082517739030655
  _2751735230932605449 -->|2| n_4775552440608800478
  style _1183944809429016101 fill:#FAFAFF
  style _7516594441774528340 fill:#FAFAFF
  style _7978386479251712764 fill:#FFFFFF
  style n_194265572021566824 fill:#FAFAFF
  style n_1232457540412805408 fill:#FAFAFF
  style _4792675656448852655 fill:#FFFFFF
  style _3232544143138661610 fill:#E7E7FF
  style _6008162635373812652 fill:#E7E7FF
  style _7864625596583603474 fill:#FFFFFF
  style _2231845523189148436 fill:#FFFFFF
  style n_6760333335114638891 fill:#FFFFFF
  style n_7392443708212353807 fill:#FFFFFF
  style _1626324112451635672 fill:#FFFFFF
  style _7040235917359351557 fill:#FFFFFF
  style n_8925240885066595420 fill:#FFFFFF
  style _6391181445701654379 fill:#FFFFFF
  style n_2529360590580469083 fill:#FFFFFF
  style n_4062147385704992595 fill:#FFFFFF
  style _1187268405029073084 fill:#FFFFFF
  style _8062160338008435956 fill:#FFFFFF
  style _8688994274347892708 fill:#FFFFFF
  style _9216642184502529798 fill:#FFFFFF
  style n_4710305265067996110 fill:#FFFFFF
  style n_4895662336838796762 fill:#FFFFFF
  style n_8868997438856158539 fill:#FFFFFF
  style _7606519017536437126 fill:#FFFFFF
  style _27936799700436060 fill:#FFFFFF
  style n_7563132947373341738 fill:#FFFFFF
  style _3192963732667889907 fill:#FFFFFF
  style _139539415853612002 fill:#FFFFFF
  style _7144708872952553836 fill:#FFFFFF
  style _6368497674408633974 fill:#FFFFFF
  style _7506035691826376527 fill:#FFFFFF
  style _3529118255250252805 fill:#FFFFFF
  style n_3969731126099003918 fill:#FFFFFF
  style _7474636469833490139 fill:#FFFFFF
  style n_7773336325209533250 fill:#FFFFFF
  style _7634212243150458484 fill:#F5F5FF
  style n_7245863080994552504 fill:#FFFFFF
  style n_3291950269559915352 fill:#FFFFFF
  style _8229577703596980426 fill:#FAFAFF
  style _7465657065378787400 fill:#FFFFFF
  style n_5269701950432783699 fill:#FFFFFF
  style _6446216386472168986 fill:#FFFFFF
  style n_5979961705843239464 fill:#FFFFFF
  style n_5951601462970580792 fill:#FFFFFF
  style _7727482673800771863 fill:#FFFFFF
  style _8858789570252260686 fill:#D4D4FF
  style _4144684539351846177 fill:#C5C5FF
  style _1503508163139766309 fill:#F5F5FF
  style n_7044887414242742577 fill:#E7E7FF
  style _5760251649658890916 fill:#EBEBFF
  style n_1743937743953222066 fill:#E7E7FF
  style n_2104865303453619159 fill:#F0F0FF
  style _7305422824435554587 fill:#CFCFFF
  style _8256903376324463459 fill:#C1C1FF
  style n_7319103074952475507 fill:#F5F5FF
  style _8290192238267553861 fill:#E7E7FF
  style n_5733096154227186625 fill:#EBEBFF
  style n_1883060305230511077 fill:#E7E7FF
  style n_5375873172119901917 fill:#EBEBFF
  style n_788834266815753489 fill:#E2E2FF
  style n_7040690479689377268 fill:#CACAFF
  style _5579716253936651218 fill:#F0F0FF
  style _5686982716783255678 fill:#FAFAFF
  style n_1065472391189712335 fill:#EBEBFF
  style _9023236468098462432 fill:#FAFAFF
  style _2210481173645739524 fill:#F5F5FF
  style _3303103327247872000 fill:#FAFAFF
  style n_8158417003762305490 fill:#FAFAFF
  style n_3972374482261021816 fill:#FAFAFF
  style n_4160518648974263094 fill:#B7B7FF
  style n_6116439064274940224 fill:#DDDDFF
  style _2690019605849135219 fill:#FFFFFF
  style _788438699244083005 fill:#FFFFFF
  style _2920806751162053123 fill:#FFFFFF
  style n_4100082517739030655 fill:#9B9BFF
  style n_5623235527225059113 fill:#DDDDFF
  style _8442906383155784854 fill:#FFFFFF
  style n_5951143071141074222 fill:#D4D4FF
  style _7453857649329036938 fill:#FAFAFF
  style n_4775552440608800478 fill:#FAFAFF
  style n_3754714412428294541 fill:#F0F0FF
  style _6519808900906610935 fill:#FFFFFF
  style n_8177051740424950144 fill:#F5F5FF
  style _684683110847593347 fill:#FFFFFF
  style n_3593585793611197277 fill:#FAFAFF
  style _2751735230932605449 fill:#FAFAFF
  linkStyle 0 stroke-width:1px
  linkStyle 1 stroke-width:1px
  linkStyle 2 stroke-width:1px
  linkStyle 3 stroke-width:2.5999985454558683px
  linkStyle 4 stroke-width:1.4363632396697823px
  linkStyle 5 stroke-width:1.1454544132232607px
  linkStyle 6 stroke-width:1.4363632396697823px
  linkStyle 7 stroke-width:1px
  linkStyle 8 stroke-width:1px
  linkStyle 9 stroke-width:1.1454544132232607px
  linkStyle 10 stroke-width:1px
  linkStyle 11 stroke-width:1px
  linkStyle 12 stroke-width:1px
  linkStyle 13 stroke-width:1.1454544132232607px
  linkStyle 14 stroke-width:2.4545441322326074px
  linkStyle 15 stroke-width:1px
  linkStyle 16 stroke-width:1.1454544132232607px
  linkStyle 17 stroke-width:1.5818176528930428px
  linkStyle 18 stroke-width:1px
  linkStyle 19 stroke-width:1.1454544132232607px
  linkStyle 20 stroke-width:1px
  linkStyle 21 stroke-width:1px
  linkStyle 22 stroke-width:1px
  linkStyle 23 stroke-width:1.8727264793395644px
  linkStyle 24 stroke-width:1.7272720661163037px
  linkStyle 25 stroke-width:1.7272720661163037px
  linkStyle 26 stroke-width:1px
  linkStyle 27 stroke-width:1.4363632396697823px
  linkStyle 28 stroke-width:1.1454544132232607px
  linkStyle 29 stroke-width:1px
  linkStyle 30 stroke-width:1px
  linkStyle 31 stroke-width:1px
  linkStyle 32 stroke-width:1px
  linkStyle 33 stroke-width:1px
  linkStyle 34 stroke-width:1px
  linkStyle 35 stroke-width:1px
  linkStyle 36 stroke-width:1.1454544132232607px
  linkStyle 37 stroke-width:1.1454544132232607px
